SET NAMES UTF8;
DROP DATABASE IF EXISTS foot;
CREATE DATABASE foot CHARSET=UTF8;
USE foot;
CREATE TABLE foot_user(
  fid INT PRIMARY KEY AUTO_INCREMENT,
  fname VARCHAR(50),
  fpwd  VARCHAR(32),
  phone CHAR(11)
);
INSERT INTO foot_user VALUES(null,'tom',md5('123'),18810001234);
INSERT INTO foot_user VALUES(null,'jerry',md5('123'),18810001234);

CREATE TABLE foot_product(
  fid INT PRIMARY KEY AUTO_INCREMENT,
  fimg VARCHAR(50),
  ftitle  VARCHAR(32),
  fscore_a CHAR(3),
  fscore_b CHAR(3),
  fscore_c CHAR(3),
  star INT,
  content VARCHAR(1000),
  time VARCHAR(25),
  do_1 VARCHAR(25),
  do_2 VARCHAR(25),
  do_3 VARCHAR(25),
  do_4 VARCHAR(25),
  do_5 VARCHAR(25),
  do_6 VARCHAR(25),
  do_7 VARCHAR(25),
  do_8 VARCHAR(25),
  do_9 VARCHAR(25),
  img_1 VARCHAR(50),
  img_2 VARCHAR(50),
  img_3 VARCHAR(50),
  img_4 VARCHAR(50),
  img_5 VARCHAR(50),
  img_6 VARCHAR(50),
  img_7 VARCHAR(50),
  img_8 VARCHAR(50),
  img_9 VARCHAR(50),
  main_1 VARCHAR(50),
  main_2 VARCHAR(50),
  main_3 VARCHAR(50),
  main_4 VARCHAR(50),
  main_5 VARCHAR(50),
  main_num_1 VARCHAR(50),
  main_num_2 VARCHAR(50),
  main_num_3 VARCHAR(50),
  main_num_4 VARCHAR(50),
  main_num_5 VARCHAR(50),
  seasoning_1 VARCHAR(50),
  seasoning_2 VARCHAR(50),
  seasoning_3 VARCHAR(50),
  seasoning_4 VARCHAR(50),
  seasoning_5 VARCHAR(50),
  seasoning_6 VARCHAR(50),
  seasoning_7 VARCHAR(50),
  seasoning_8 VARCHAR(50),
  seasoning_9 VARCHAR(50),
  seasoning_10 VARCHAR(50),
  seasoning_num_1 VARCHAR(50),
  seasoning_num_2 VARCHAR(50),
  seasoning_num_3 VARCHAR(50),
  seasoning_num_4 VARCHAR(50),
  seasoning_num_5 VARCHAR(50),
  seasoning_num_6 VARCHAR(50),
  seasoning_num_7 VARCHAR(50),
  seasoning_num_8 VARCHAR(50),
  seasoning_num_9 VARCHAR(50),
  seasoning_num_10 VARCHAR(50),
  last_text VARCHAR(500)

);


INSERT INTO foot_product VALUES(null,'1.jpg',"最好吃的香辣虾",1,0,1,3,"香辣虾是属于乱劈柴香辣干锅的一种，重庆乱劈柴干锅包块：香辣虾、干锅鱼、干锅兔等系列产品。乱劈柴干锅是重庆邦辉餐饮集团旗下品牌，更多香辣虾介绍请关注重庆乱劈柴干锅官网。","20分钟","把虾剥壳、洗干净、准备好烹饪配料","把洗好的土豆切成条，黄瓜切条，红椒切成段，老姜切片、准备在旁边","在烧热的油锅里倒入土豆炸微黄，下入黄瓜和蒜子，炸一下，捞出，大火烧油复炸一次吐油。","把准备好的虾放入油锅里炸变色、复炸一下","锅里的油全部出来，剩下的油小火把豆瓣和剁椒炒和油完全融合，放入姜片炒匀","放入虾，烹入一汤匙料酒，一茶匙糖，半碗高汤翻炒均匀稍微煨3-5分钟","再倒入之前炸好的配菜一起翻炒","关火、放点鸡精，这样味道更好，然后就起锅了，最好吃的乱劈柴干锅香辣虾起锅了",null,'1-1.jpg','1-2.jpg','1-3.jpg','1-4.jpg','1-5.jpg','1-6.jpg','1-7.jpg','1-8.jpg',null,"鲜虾","黄瓜","土豆","红椒",null,"500g","1根","2个","2-4个",null,"蒜瓣","剁椒","老姜","盐","料酒","高汤","油","糖",null,null,"15个","半勺","1块","适量","一勺汤","高汤","适量","一勺",null,null,"虾一定要鲜虾肉质吃起来口味更好");


INSERT INTO foot_product VALUES(null,'2.jpg',"美味的红烧肉",1,1,1,2,"魔兽也爱吃肉哦，这款红烧肉超级好吃，朋友们动手做起来^_^","1小时","五花肉洗净切块","锅内放半锅冷水，肉一同冷水下锅，水开后大火煮两分钟，捞出用温水冲洗干净，沥干水分。","放入五花肉大火煸炒，直至肉块两面金黄油脂冒出，用锅铲盛出一部分油。","放老抽翻炒上色，大约一分钟左右。","放入料酒炒香后放入盐，糖，注入热水没过肉块，锅内放一个葱结，大火烧开后转小火焖煮一个小时。","时间差不多时，开大火收汁，放入鸡精调味，翻炒几下后撒入葱花起锅。","香喷喷的红烧肉装盘上桌，开吃^_^","软糯鲜香的红烧肉，来碗米饭，绝配哦。","肥而不油，瘦而不柴，绝对好吃^_^",'2-1.jpg','2-2.jpg','2-3.jpg','2-4.jpg','2-5.jpg','2-6.jpg','2-7.jpg','2-8.jpg','2-9.jpg',"五花肉",null,null,null,null,"500g",null,null,null,null,"老抽","剁椒","老姜","盐","料酒","八角","油","糖",null,null,"10g","半勺","1块","适量","一勺汤","2个","10g","5g",null,null,"小贴士 红烧肉要多焖一会才会更酥烂，老抽是用来上色的，如果喜欢放生抽，也可以，但要注意盐量，以免放多了太咸。鸡精可随个人口味放与不放，不放也很好吃的，如果喜欢入口即化的感觉，大火煮开后焖一个半小时。");


INSERT INTO foot_product VALUES(null,'3.jpg',"小炒韭菜花",1,0,0,4,"很简单的一道家常菜，在家经常做，因为老公喜欢！","20分钟","韭菜花洗净切段","鸡蛋打均","香肠切薄片用料酒处理下","油锅7成热","放入蛋液","倒入香肠片翻炒出香味","倒入韭菜花翻炒","加盐，少量水，大火翻炒50秒","加味精起锅装盘",'3-1.jpg','3-2.jpg','3-3.jpg','3-4.jpg','3-5.jpg','3-6.jpg','3-7.jpg','3-8.jpg','3-9.jpg',"韭菜花","鸡蛋","广式香肠",null,null,"适量","2个","1根",null,null,"盐","油",null,null,null,null,null,null,null,null,"适量","适量",null,null,null,null,null,null,null,null,"因为是一锅炒，所以油适当放多点； 其实用川味香肠或腊肉风味更佳");


INSERT INTO foot_product VALUES(null,'4.jpg',"鱼香茄子",1,1,0,3,"这道菜味道鲜美、柔软润香、鲜咸适口、营养也非常丰富。下饭更是一大特点，拌着米饭吃，唇齿留香。","30分钟","将茄子切成约七八厘米的长条、蒜切末、小红辣椒切段、豆瓣酱剁碎备用。"," 往茄条里撒少许盐，然后拌匀。让其腌制10分钟左右。","取一只干净的小碗，然后依次放入玉米淀粉、糖、鸡精、生抽、醋，再倒入半碗清水，调成碗汁备用。","锅中加入适量的油，油热后将茄条依次放入锅中煎炸至表面微黄后盛出备用。","另换一只锅，锅中加入少许底油，然后将肉馅倒入锅中煸炒。","煸炒至肉馅变白成熟，加入豆瓣酱、小红辣椒煸炒匀均。","加入蒜末煸炒出香味。","将茄条放入锅中煸炒。","将碗汁倒入锅中，大火烧开后翻炒匀均。然后关火淋少许香油即可装盘。",'4-1.jpg','4-2.jpg','4-3.jpg','4-4.jpg','4-5.jpg','4-6.jpg','4-7.jpg','4-8.jpg','4-9.jpg',"蒜","猪肉馅","小红辣椒",null,null,"适量","适量","适量",null,null,"盐","鸡精","糖","生抽","醋","香油","玉米淀粉",null,null,null,"1大勺","1大勺","2勺","2勺","2勺","适量","适量",null,null,null,"小贴士 １、 这道菜在选茄子的时候，最好选用长茄子。 ２、 茄子的皮很有营养，最好留下。 ３、 辣椒的量可根据自己的口味适当增加减少。 ４、 豆瓣酱有盐味。所以在腌茄子的时候，放盐一定要小心。如果放了太多，就要过水清洗一下。 ５、 煎炸茄子的时候最好用平底锅。这样一次炸的茄子量多，还省油。");


INSERT INTO foot_product VALUES(null,'5.jpg',"鱼香肉丝好吃的三个秘诀",1,1,1,3,"鱼香肉丝做法并不难，但要出“咸甜酸微辣”、“红油满溢”的鱼香肉丝，要注意三个关键点。一是选材。里脊肉是首选，这样吃起来较为鲜嫩。要选择质量好的红泡椒，下锅前细细剁碎，这样才能炒出鲜亮的红油。二是火候。炒鱼香肉丝要猛火快炒，火要够大，锅气要足，这样炒出的菜味道自然不赖。三是比例。鱼香肉丝讲究“见油不见汤”，鱼香汁的调料比例要拿捏好，酱油、香醋、酒、白糖和水淀粉的比例为1:1:1:1.5:2；水淀粉不易过多，否则做出来的菜会芡汁太厚、汤汁过多。葱姜蒜的比例为",
"30分钟","猪肉先横向切成片，再切成火柴棍大小的肉丝。","肉丝中加入半小勺盐和一小勺淀粉，搅拌均匀。","冬笋和黑木耳切丝。","泡椒剁碎，姜蒜剁碎，葱切碎。","一汤匙酱油，一汤匙香醋，一汤匙料酒，一汤匙半白糖，两汤匙水淀粉，调成鱼香汁。","笋丝、木耳丝过滚水烫熟备用。","大火将锅烧热，下比平时炒菜稍多一点的油，烧到六成热下肉丝滑炒。","滑炒到肉丝变白，加入泡椒和姜蒜，翻炒约两分钟，炒出红油。","将笋丝、木耳丝放入翻炒几下，倒入鱼香汁和葱末，翻炒均匀即可出锅！",'5-1.jpg','5-2.jpg','5-3.jpg','5-4.jpg','5-5.jpg','5-6.jpg','5-7.jpg','5-8.jpg','5-9.jpg',"鲜虾","黄瓜","土豆","红椒",null,"500g","1根","2个","2-4个",null,"干淀粉","油","食盐","酱油","料酒或米酒","水淀粉","香醋","白糖",null,null,"1小勺","适量","0.5小勺","1汤匙","1汤匙","2汤匙","1汤匙","1.5汤匙",null,null,"小贴士 1、腌制猪肉时可以加入少许蛋清，上浆效果更好，猪肉更嫩滑。 2、鸡精或味精按个人喜好来加，菜本身够鲜够好吃了，我就没加。");


INSERT INTO foot_product VALUES(null,'6.jpg',"懒人版糖醋排骨",0,1,0,4,"这个糖醋排骨为什么叫懒人版呢？也就是它的制作过程比较简单，调料用的也非常的少，省时省力也能吃上糖醋排骨。用电饭煲制作更加的省力。放到电饭煲里按下按键，你就等着吃吧。懒人吃货必备。","1小时","肋排骨斩成小块儿洗净。","放入冷水锅里烧开水去血沫。","捞出控水","锅里放入植物油，把冰糖放进去小火炒化。","炒到糖汁变褐色起密泡。","把控干水的排骨放进翻炒。","炒至每一块排骨都上糖色关火。","装入电饭煲内胆，加一勺料酒，2勺香醋，适量盐，水，水量不能超过排骨的一半。按下电饭煲蒸煮键，时间一小时。","程序结束出锅，撒上熟白芝麻即可。",'6-1.jpg','6-2.jpg','6-3.jpg','6-4.jpg','6-5.jpg','6-6.jpg','6-7.jpg','6-8.jpg','6-9.jpg',"排骨",null,null,null,null,"700g",null,null,null,null,"冰糖","料酒","熟白芝麻","姜丝","香醋","盐",null,null,null,null,"10块","1勺","适量","适量","2勺","适量",null,null,null,null,"电饭煲做这个排骨，水一定不要放多了。电饭煲不吃水，糖醋排骨的糖汁不适合多。喜欢甜的可以入锅时再放一勺白糖，喜欢酸一点的可以多加一点醋。");


INSERT INTO foot_product VALUES(null,'7.jpg',"糖醋排骨",1,0,1,4,"糖醋排骨其色泽酱红，肉质酥烂，骨香浓郁，汁浓味鲜，咸中带甜，充分体现了无锡菜肴的基本风味特征。这与一般一次成型或者是炸过以后直接上糖醋汁的在口感上截然不同。 这个菜谱可谓是我的私房菜谱，大学同学十年再见还恋恋不忘我做的糖醋排骨。这款无锡糖醋排骨吃起来外面糖醋味、里面咸甜味、而骨头里的汁水都让人不忍放过。当然如此多重的口味做起来的确会复杂一些。可我认为一款压箱底的菜值得这样去做。 排骨一定要选择有脆骨的前排，肥瘦相连，最好不要有杂排","1小时","排骨切三厘米左右长","下油爆香姜片","下排骨过油至两头骨头封闭，捞出控油。这个步骤是为了封住肉汁和骨髓。因此千万不要把排骨焯水，焯过水的排骨肉香至少减一半。","锅里放水烧开，水刚到排骨，一次性放入足够水，中途不要加冷水。放入排骨，加老抽、生抽、陈醋、料酒、白糖、盐、八角、葱。这里必须用热水，热水才能让肉质鲜美，冷水入锅的话肉汁都到汤里去了。还有这时要大胆快速的下陈醋，这是为了使肉质鲜美骨头酥软，不用担心肉会变酸，因为酸在焖煮过程中放挥发掉。","小火焖煮至汤浓，余下一些汁，将排骨盛出。如果水余比较多可以大火收汁缩短时间。","锅里放少量猪油，放白糖，用小火融化","等糖变成这样就把排骨倒进去","沿锅边淋香醋，拌匀，因为有汁小火焖一分钟出锅","正宗的无锡糖醋排骨外面糖醋味里面咸香味，肉质酥烂，连骨头里都是满满的汁，每次我和先生都要把骨头咬碎吸干。",'7-1.jpg','7-2.jpg','7-3.jpg','7-4.jpg','7-5.jpg','7-6.jpg','7-7.jpg','7-8.jpg','7-9.jpg',"前排","姜片","老抽","料酒","葱","500 g","3片","10ml","15ml","一根","八角","陈醋","糖","盐","生抽","猪油","香醋或者陈醋",null,null,null,"一个","15ml","25g","4g","15ml","30ml","10ml",null,null,null,"糖醋排骨-绝对的私房菜谱");


INSERT INTO foot_product VALUES(null,'8.jpg',"凉拌菜",1,1,1,2,"这道家常凉拌菜，2元能拌一大盘，酸甜爽口，超级下酒下饭菜，好吃不长肉，我家几乎每天都要拌上一大盘，老人孩子都爱吃，而且物美价廉。","20分钟","准备食材，黄瓜最好去皮，不去皮要用面粉反复揉搓后清洗干净，尽量减少农药残留。胡萝卜去皮洗净，干豆腐是从外县买来的，特别薄，有豆香味，一次买很多，冻在冰箱里，随时享用。","干豆腐解冻后有水分，过水焯一下更好吃，捞出空净水分。","胡萝卜擦丝或者切丝，过水焯一下，捞出过冷水控净水分。","大蒜去皮洗净切碎，黄瓜切丝，控净水分的干豆腐切丝。","取大盆，加入所有准备好的食材，根据个人的口味加入适量的盐、白糖、醋、味极鲜酱油、辣椒油和花椒油。","拌匀就OK啦！","装盘。酸甜微辣，爽口开胃的凉拌菜上桌，可以开餐了。",null,null,'8-1.jpg','8-2.jpg','8-3.jpg','8-4.jpg','8-5.jpg','8-6.jpg','8-7.jpg',null,null,
"黄瓜","胡萝卜","干豆腐",null,null,"1根","1根","一张",null,null,"辣椒油","白糖","味极鲜酱油","盐","花椒油","醋","大蒜",null,null,null,"适量","适量","适量","适量","适量","适量","适量",null,null,null,null);


INSERT INTO foot_product VALUES(null,'9.jpg',"清蒸鲍鱼",0,1,1,3,"一般来说海鲜的做法都较为简单，可营养价值却比肉类丰富，所以海鲜是比较适合懒人来烹饪的美食之一！下面就和亲们们分享一道清蒸鲍鱼的做法！","20分钟","将鲍鱼清洗干净后改刀，切成十字花，放入盘中备用，同时可在鲍鱼周围放上一些姜片以去除鲍鱼的腥味（我买的鲍鱼是速冻的，所以需要生姜去腥，如果是鲜活的鲍鱼可不用姜片）","将蒜切成蒜末，然后加入鲍汁3勺，香油2勺，酱油1勺，糖半勺，搅拌均匀","将调好的酱汁儿用小勺子均匀地浇在鲍鱼上，然后上蒸锅蒸，待水沸腾后蒸3分钟即可出锅",null,null,null,null,null,null,'9-1.jpg','9-2.jpg','9-3.jpg',null,null,null,null,null,null,"鲍鱼",null,null,null,null,"8只",null,null,null,null,"蒜","生姜","鲍汁","酱油","香油","糖",null,null,null,null,"1头","1块","适量","适量","适量","适量",null,null,null,null,"一般来说海鲜的做法都较为简单，可营养价值却比肉类丰富，所以海鲜是比较适合懒人来烹饪的美食之一");


INSERT INTO foot_product VALUES(null,'10.jpg',"蚝汁鲍鱼仔",0,0,1,4,"鲍鱼中含有大量的蛋白质，有养肝明目、调经、润燥利肠之功效。鲍鱼虽补，但是不燥，很适合在夏天食用。不过您千万要注意，鲍鱼的内脏是不能吃的，食用鲍鱼之前一定要将其处理干净哦！今儿我不光跟您分享蚝汁鲍鱼仔的做法，还会手把手的教您如何处理鲍鱼。快来看看吧！","30分钟","首先用牙刷将鲍鱼肉周边的黑色物质刷掉,然后用刀从九孔对面扁平一边切入。","将鲍鱼肉和壳完全分开。","就会看到黄黑色的肚肠。把肚肠去掉就好哈～","把处理好的鲍鱼肉冲洗干净，打上十字花刀，千万不要把肉切断哦～","锅中做水，将打好花刀的鲍鱼凉水下锅，水开了煮三分钟后捞出。水里要放一点底盐和料酒哦～","将刷干净的鲍鱼壳也在沸水里煮上两三分钟消毒去腥。","锅中倒油，爆香葱姜后放入两勺蚝油翻炒后倒入水或高汤。","水开后将焯好的鲍鱼放入。","之后再烹入酱油、一点老抽搅拌均匀。烧制两分钟左右淋入水淀粉收汁儿。出锅前撒上蒜末翻炒两下就完成啦。然后把做好的鲍鱼码入鲍鱼壳，再撒上点小葱啊或者青红椒粒装饰就可以美美的上桌啦！",'10-1.jpg','10-2.jpg','10-3.jpg','10-4.jpg','10-5.jpg','10-6.jpg','10-7.jpg','10-8.jpg',"10-9.jpg","鲍鱼仔","葱姜蒜",null,null,null,"8头","若干",null,null,null,"蚝油","老抽","酱油","水淀粉",null,null,null,null,null,null,"少许","适量","适量","适量",null,null,null,null,null,null,"小贴士 鲍鱼焯水一定要凉水下锅哦～ 否则您就等着吃胶皮条儿吧哈哈～");

INSERT INTO foot_product VALUES(null,'11.jpg',"曲奇饼干",1,1,0,5,"试用了卡士电子烤箱，这款饼干没有用到鸡蛋，酥脆可口，奶香气十足。 直接用烤箱的预置曲奇功能烤的，温度和时间刚刚好。","30分钟","黄油室温软化，不要太软。糖粉倒在黄油上，用电动打蛋器先把糖粉和黄油搅一下再打，以免糖粉扑飞。","淡奶油隔热水稍稍加热，不要使用刚刚从冰箱里拿出来的淡奶油，以免接触到黄油温差太多造成水油分离的现象。","淡奶油分次加入黄油中，每次都充分打匀再加下一次。打好的黄油质地发白呈尖峰似羽毛状。","将低粉筛入黄油中，用刮刀翻拌均匀。","用8齿星星嘴挤在烤盘上，烤盘上要垫耐高温油布或硅胶垫。","烤箱预置的曲奇功能是上火180度，底火160度，烤20分钟。 在挤的时候就可以先将功能调好，并开始启动，烤箱会在前几分钟进行预热，达到预热温度的时候会有三声蜂鸣，此时将烤盘放入。 第二层烤20分钟即可。"," 高大上的烤箱有很多预置功能,相应的功能下还可以在设定范围内调节时间和温度哦.",null,null,'11-1.jpg','11-2.jpg','11-3.jpg','11-4.jpg','11-5.jpg','11-6.jpg','11-7.jpg',null,null,"黄油","淡奶油","低筋面粉",null,null,"120克","100克","220g",null,null,"糖粉",null,null,null,null,null,null,null,null,null,"70克",null,null,null,null,null,null,null,null,null,"曲奇饼干");


INSERT INTO foot_product VALUES(null,'12.jpg',"酸辣藕带",0,1,0,4,"藕带，估计有些童鞋都不知道是什么？幸亏我们湖北得天独厚的条件了， 看过“舌尖上的中国”，就知道湖北是莲藕的重要原产地。那我们介绍的藕带，是还没有成形的藕，也是最嫩的藕，是荷的根茎。种藕的顶芽萌发后抽出白嫩细长的地下茎，被称为“藕带”，它长如筷子、细如手指的，白胖粗嫩且新鲜水灵。藕带生长过程非常快，鲜嫩细白的“青春”周期极短，因此时令性极强，价格一直居高不下，吃它可比吃肉还贵哟。","20分钟","藕带斜切成片","将切好的藕带片泡在淡盐水中， 再准备好其他原料","烧热锅， 加入适量的油， 下入红椒和大蒜片爆香","再加入切好的藕带翻炒","翻炒几下后， 加入适量的盐， 糖和白醋","翻炒均匀即可","清脆可口的酸辣藕带就做好了。",null,null,'12-1.jpg','12-2.jpg','12-3.jpg','12-4.jpg','12-5.jpg','12-6.jpg','12-7.jpg',null,null,"藕带",null,null,null,null,"400克",null,null,null,null,"红辣椒","蒜","小葱","白醋","糖","油盐",null,null,null,null,"适量","适量","适量","适量","适量","适量",null,null,null,null,"这是道很普通的家常小炒菜，为了保持藕带的洁白如玉的颜色，在切时尽量避免用其氧化，切好后立即放入淡盐水中和炒时要加入白醋，大火快炒；如果想使得藕带口感层次更丰富，在酸辣的口味上适量的加入少许的糖。");


INSERT INTO foot_product VALUES(null,'13.jpg',"小炒玉米虾米",1,1,1,3,"玉米有抗衰老作用， 抗眼睛衰老的佳品","20分钟","玉米洗干净，备用","马蹄，红萝卜。切丁，备用","干虾米泡软切丁","热锅热油小火爆香蒜容","马蹄，红萝卜丁，虾米干放入翻炒。变软","加入玉米翻炒断生。。分二次加入清水，第一次煸炒到水干，再加入一次清水，盖窝煮五分钟。最后放入鸡精调味提鲜，撒上葱花。。翻炒均匀","关火装碗",null,null,'13-1.jpg','13-2.jpg','13-3.jpg','13-4.jpg','13-5.jpg','13-6.jpg','13-7.jpg',null,null,"甜玉米","马蹄","干虾米","红萝卜",null,"二根","三粒","适量","适量",null,"油","鸡精","清水","蒜容",null,null,null,null,null,null,"适量","适量","适量","适量",null,null,null,null,null,null,"玉米，要用甜玉米才好吃，，水分多，清甜，可口");


INSERT INTO foot_product VALUES(null,'14.jpg',"韩国排骨汤",0,1,1,2,"韩国料理中最爱之一","30分钟","排骨泡水4小时左右泡掉血水，中间按情况换水 。 煮開一鍋水，放入排骨,燙五~六分,撈起排骨，用冷水沖洗淨,把鍋裡的水倒掉。","再換一鍋清水,加入韓國的高燙料,沒有也沒關係。放入蒜、姜、葱、酒、辣椒粉、盐和酱油，放入排骨一起炖。","炖至1~2小时候之后，放入土豆继续炖，直至土豆炖熟。","用大醬，辣椒粉，鹽和芝麻盐混製，倒入锅里。","然後加入白菜、金針菇等 稍煮就可以裝鍋上桌了。",null,null,null,null,'14-1.jpg','14-2.jpg','14-3.jpg','14-4.jpg','14-5.jpg',null,null,null,null,"排骨","土豆","白菜","牛骨高湯粉",null,"一公斤","四个","半棵","适量",null,"大蒜","大葱","生姜","酱油","辣椒粉","芝麻","韩式辣酱",null,null,null,"四颗","二根","兩块","适量","适量","适量","1大勺",null,null,null,null);


INSERT INTO foot_product VALUES(null,'15.jpg',"饺子皮葱油饼",1,0,1,3,"每次家里包饺子的时候，总是会多出来一点材料来，要么是馅料，要么是饺子皮，就没有正好的时候。处女座的人会不会觉得特别别扭啊，哈哈。在我看来，一切都不是问题。多余的馅料可以直接煎成肉饼，或者煮肉丸汤，多余饺子皮就可以拿来做葱油饼啦。","20分钟","准备好所有的食材。","取一片饺子皮，刷一层薄薄的色拉油。也可以把色拉油换成葱油，味道会更加香。","然后刷一层烧烤酱。如果没有烧烤酱的话，也可以撒盐、胡椒粉、孜然粉等调味料。家里有什么就用什么吧，我有一次直接把中午烧的梅干菜肉挖了一大勺，剁碎一些就可以用了，类似梅干菜饼的味道。","然后将切好的葱花均匀的撒在饺子皮上面，多少随意。","再取一块饺子皮盖在葱花上面，我用稍微按压一下，让两片饺子皮贴合在一起。","重复上面刷油、刷酱料、撒葱花的步骤，五个饺子皮为一组重叠起来","用擀面杖将饺子皮擀成厚薄均匀的大圆饼状。","电饼铛预热，刷油，然后将擀开的饺子皮放入电饼铛中。","一面煎至金黄以后翻面，将两面都煎至金黄色就可以了。",'15-1.jpg','15-2.jpg','15-3.jpg','15-4.jpg','15-5.jpg','15-6.jpg','15-7.jpg','15-8.jpg','15-9.jpg',"饺子皮",null,null,null,null,"10个",null,null,null,null,"色拉油","小葱","烧烤酱",null,null,null,null,null,null,null,"一勺","一颗","一勺",null,null,null,null,null,null,null,null);


INSERT INTO foot_product VALUES(null,'16.jpg',"广东肠粉",1,1,1,2,"关于广式肠粉的起源，目前似乎还没有统一的说法，据说早在清代末期，广州街头上就能听到卖肠粉的叫卖声。也有传说是乾隆皇帝游江南那会儿，被纪晓岚拐骗去粤西吃肠粉，当即赞不绝口，并乘兴说：“这米粉有点像猪肠子”，所以就叫肠粉了。","30分钟","用我们家里平时用的米杯子来配粉浆，一杯粉加1.25杯水（体积比1:1.25/重量比1:2.5）","把粉和水混合在一起，搅拌均匀；","蒸盘中倒入薄薄的一层粉浆，之后可以加入您喜欢吃的馅料；","在锅内倒入适量的水，煮开，将盛有粉浆的铁盘放入锅内隔水蒸； 一次制作多碟肠粉可以将铁盘十字型层叠错开：","取出蒸盘，用刮刀卷起装碟，即可调味食用。调味可以用海鲜酱油、蚝油调味，视个人口味。","完美出桌。",null,null,null,'16-1.jpg','16-2.jpg','16-3.jpg','16-4.jpg','16-5.jpg','16-6.jpg',null,null,null,"肠粉专用粉","清水",null,null,null,"适量","适量",null,null,null,"馅料",null,null,null,null,null,null,null,null,null,"适量",null,null,null,null,null,null,null,null,null,"蒸肠粉的时候，确保蒸锅里有足够的水汽，蒸汽足才不会干巴巴。");


INSERT INTO foot_product VALUES(null,'17.jpg',"酥脆油条的做法",0,1,0,3,"传统炸油条都是采用的明矾膨松剂，由于明矾含有铝会造成油条的铝超标，很多炸油条的改用了无铝油条膨松剂，采用无铝膨松剂炸油条个头很大，就是口感韧性大，吃起来不是很松软。 酥脆油条膨松剂是一种新型的无铝油条膨松剂，它不含明矾，完全是采用无铝的物料复配而成，其特点和明矾膨松剂类似，炸的油条十分酥脆，这样既解决了油条含铝的问题，又解决了油条不酥脆的技术问题。","30分钟","按照配方要求称量面粉,酥脆油条膨松剂,植物油,食盐,水","再把酥脆油条膨松剂撒在面粉中混合均匀。","然后分别加入食用油、食盐，再加水和面。","和成光滑面团。和面要求：和成表面光滑的面团，一般要求“三光”，即盆光、手光、面光。","将和好的面团分块包膜","把醒发好的面团擀成面片,切成大小相同的条形","把两个面片叠加在一起，用筷子在叠好的面片中间压一下，捏着面片的两头让面片黏在一起，根据面片的大小拉成一定的长条。","事先把油炸锅的油温加热到210度左右，把拉好的长条放入油锅中，用筷子不断的翻滚，油条膨大、色泽金黄，即可。",null,'17-1.jpg','17-2.jpg','17-3.jpg','17-4.jpg','17-5.jpg','17-6.jpg','17-7.jpg','17-8.jpg',null,"面粉","酥脆油条膨松剂","食用油",null,null,"1公斤","25克","50克",null,null,"食盐","水",null,null,null,null,null,null,null,null,"15g","0.6公斤",null,null,null,null,null,null,null,null,"酥脆油条膨松剂是一种新型的无铝油条膨松剂，它不含明矾，完全是采用无铝的物料复配而成，其特点和明矾膨松剂类似，炸的油条十分酥脆，这样既解决了油条含铝的问题，又解决了油条不酥脆的技术问题。");


INSERT INTO foot_product VALUES(null,'18.jpg',"西红柿炒鸡蛋",1,0,1,4,"西红柿炒鸡蛋",
"20分钟","把大番茄放入容器里；倒入开水浸泡2分钟，让番茄在热水里翻滚一会；这样可以轻松去掉番茄的外皮,切成细丁；热锅冷油后放入番茄丁中小火边炒边用勺子碾压","当番茄汁变得浓稠时加入一勺白糖和适量盐调味，出锅备用","鸡蛋打入碗里，加入适量盐，打散后加一勺水继续打散","加入切好的香葱继续打散鸡蛋","热锅到锅子冒一点烟后加入食用油，晃动一下锅子，让锅四周都有沾到油；下蛋液，轻轻转动锅子让蛋液流向四周，马上小火，凝结后弄碎鸡蛋出锅备用","小番茄切块；","热锅冷油加入生姜丝煸炒出香味；放入番茄块，大火翻炒","上淋上一点点料酒，大火再翻炒几下；慢慢加入上面做好的番茄酱（多少随你），不断翻炒","加入炒好的鸡蛋撒上香葱就可以出锅了。",'18-1.jpg','18-2.jpg','18-3.jpg','18-4.jpg','18-5.jpg','18-6.jpg','18-7.jpg','18-8.jpg','18-9.jpg',"大番茄","鸡蛋","小番茄",null,null,"适量","适量","适量",null,null,"白糖","料酒","食用油","香葱","盐",null,null,null,null,null,"适量","适量","适量","适量","适量",null,null,null,null,null,"小贴士 1.最重要的是这道菜让美味和营养兼得了：用番茄酱做配料，给主料里的番茄入味，让其裹上香浓的番茄酱，而主料的番茄用爆炒的方式，营养不流失，是不是很绝！ 2.怎么打鸡蛋？用筷子朝一个方向用力打散,筷子的运动是个圆锥形，这个圆锥下面是碗底，锥顶在碗正上方，距离碗底6厘米左右吧，这样打可以让空气进去，让蛋清和蛋黄充分融合，记住还要加点水，鸡蛋才更嫩； 3.番茄红素主要存在于番茄皮里，所以主料里的小番茄就没有去皮，但是做番茄酱的时候为了不影响口感就要去掉； 4.做番茄酱时加一点白糖，可以中和番茄的酸，口感更好，最后炒番茄时加入的番茄酱的量也要适中，番茄酱可以适当多加一点点盐，那么炒番茄的时候就不用放盐了； 5.一定要挑成熟的番茄。市面上番茄虽然很红，但是很多根本就没有熟，所以买的时候可以捏一下番茄，很硬的不要买，里面还是生的，越红当然越好，柔软适中的，如果买不到很熟的，记得在室温下放几天，番茄也会慢慢变熟的； 6.炒鸡蛋和炒西红柿虽然都是热锅冷油，但是炒鸡蛋热锅冷油后再让油稍微烧一会，同时让油敷满锅底就不会粘锅，鸡蛋马上会膨胀开来。");


#CREATE TABLE foot_product_1(
#  fid_1 INT PRIMARY KEY AUTO_INCREMENT,
#  img VARCHAR(50),
#  content_1 VARCHAR(250),
#);
#INSERT INTO foot_product VALUES(null,'1-1.jpg',"把虾剥壳、洗干净、准备好烹饪配料");
#INSERT INTO foot_product VALUES(null,'1-2.jpg',"把洗好的土豆切成条，黄瓜切条，红椒切成段，老姜切片、准备在旁边");
#INSERT INTO foot_product VALUES(null,'1-3.jpg',"在烧热的油锅里倒入土豆炸微黄，下入黄瓜和蒜子，炸一下，捞出，大火烧油复炸一次吐油。");
#INSERT INTO foot_product VALUES(null,'1-4.jpg',"把准备好的虾放入油锅里炸变色、复炸一下");
#INSERT INTO foot_product VALUES(null,'1-5.jpg',"锅里的油全部出来，剩下的油小火把豆瓣和剁椒炒和油完全融合，放入姜片炒匀");
#INSERT INTO foot_product VALUES(null,'1-6.jpg',"放入虾，烹入一汤匙料酒，一茶匙糖，半碗高汤翻炒均匀稍微煨3-5分钟");
#INSERT INTO foot_product VALUES(null,'1-7.jpg',"再倒入之前炸好的配菜一起翻炒");
#INSERT INTO foot_product VALUES(null,'1-8.jpg',"关火、放点鸡精，这样味道更好，然后就起锅了，最好吃的乱劈柴干锅香辣虾起锅了");